<script setup lang="ts">
const dataUrl = [
  {
    id: 1,
    text: '1. Общие положения',
    url: '',
  },
  {
    id: 2,
    text: '2. Общие обязанности водителей',
    url: '',
  },
  {
    id: 3,
    text: '3. Применение специальных сигналов',
    url: '',
  },
  {
    id: 4,
    text: '4. Обязанности пешеходов',
    url: '',
  },
  {
    id: 5,
    text: '5. Обязанности пассажиров',
    url: '',
  },
  {
    id: 6,
    text: '6. Сигналы светофора и регулировщика',
    url: '',
  },
  {
    id: 7,
    text: '7. Применение аварийной сигнализации и знака аварийной остановки',
    url: '',
  },
  {
    id: 8,
    text: '8. Начало движения, маневрирование',
    url: '',
  },
  {
    id: 9,
    text: '9. Расположение транспортных средств на проезжей части',
    url: '',
  },
  {
    id: 10,
    text: '10. Скорость движения',
    url: '',
  },
  {
    id: 11,
    text: '11. Обгон, опережение, встречный разъезд',
    url: '',
  },
  {
    id: 12,
    text: '12. Остановка и стоянка',
    url: '',
  },
  {
    id: 13,
    text: '13. Проезд перекрестков',
    url: '',
  },
  {
    id: 14,
    text: '14. Пешеходные переходы и места остановок маршрутных транспортных средств',
    url: '',
  },
  {
    id: 15,
    text: '15. Движение через железнодорожные пути',
    url: '',
  },
  {
    id: 16,
    text: '16. Движение по автомагистралям',
    url: '',
  },
  {
    id: 17,
    text: '17. Движение в жилых зонах',
    url: '',
  },
  {
    id: 18,
    text: '18. Приоритет маршрутных транспортных средств',
    url: '',
  },
  {
    id: 19,
    text: '19. Пользование внешними световыми приборами и звуковыми сигналами',
    url: '',
  },
  {
    id: 20,
    text: '20. Буксировка механических транспортных средств',
    url: '',
  },
  {
    id: 21,
    text: '21. Учебная езда',
    url: '',
  },
  {
    id: 22,
    text: '22. Перевозка людей',
    url: '',
  },
  {
    id: 23,
    text: '23. Перевозка грузов',
    url: '',
  },
  {
    id: 24,
    text: '24. Дополнительные требования к движению велосипедистов, водителей мопедов и лиц, использующих для передвижения средства индивидуальной мобильности',
    url: '',
  },
  {
    id: 25,
    text: '25. Дополнительные требования к движению гужевых повозок, а также к прогону животных',
    url: '',
  },
  {
    id: 26,
    text: '26. Нормы времени управления транспортным средством и отдыха',
    url: '',
  },
  {
    id: 27,
    text: 'Приложение 1. Дорожные знаки (по ГОСТу Р 52289-2019 и ГОСТу Р 52290-2004)',
    url: '',
  },
  {
    id: 28,
    text: 'Приложение 2. Дорожная разметка и ее характеристики (по ГОСТу Р 51256-2018 и ГОСТу Р 52289-2019)',
    url: '',
  },
  {
    id: 29,
    text: 'Приложение N 3. Особенности организации дорожного движения в период проведения XXII Олимпийских зимних игр и XI Паралимпийских зимних игр 2014 года в городе Сочи. - Утратило силу',
    url: '',
  },
]

const handleClickUrl = (id: number) => {
  console.log(id)
}
</script>

<template>
  <div class="wrapper">
    <ul>
      <li v-for="(href, index) in dataUrl" :key="index" class="href-item">
        <label class="text-href" @click="handleClickUrl(href.id)">{{ href.text }}</label>
      </li>
    </ul>
  </div>
</template>

<style scoped>
.wrapper {
  margin-top: 50px;
  padding: 20px;
  padding-left: 100px;
}

.href-item {
  list-style: circle;
  text-align: left;
  margin-bottom: 15px;
}

.text-href {
  font-size: 1.2rem;
  font-weight: bold;
  color: #333;
  cursor: pointer;
  transition: color 0.3s ease;
}

.text-href:hover {
  color: #007bff; /* Цвет при наведении */
}

.text-href:active {
  color: #0056b3; /* Цвет при нажатии */
}
</style>
